---
kind: method
id: M:Autodesk.Revit.DB.InternalDefinition.Dispose
source: html/29987073-4c53-83ce-8daf-006ca3ee4196.htm
---
# Autodesk.Revit.DB.InternalDefinition.Dispose Method

Releases all resources used by the InternalDefinition

## Syntax (C#)
```csharp
public void Dispose()
```